'''
1. Наведіть програмний приклад синтаксичної та логічної помилки:
синтаксична помилка означає, що ви написали щось, що не відповідає правилам Python, це правила орфографії й граматики в Python
наприклад:
    prnt("Hello world!") або print"Hello world!")
логічна помилка, це помилки пов'язані з логікою виконання коду, наприклад:
b    print()
    b = 2
'''
'''
2. Який  буде результат 1 / 0, 0 /1 зафиксувати та пояснити
'''
'''
a = 1
b = 0
print(a / b)
# Результат буде 0
print(b / a)
# Результат буде помилка ділення ZeroDivisionError: division by zero метематично на 0 ділити не можна
'''

'''
3. Навіщо потрібні коментарі
Основне завдання коментарів - пояснити, що та як має робити код або пояснити взаємодію всіх його частин...
'''

'''
4. Що таке змінна
Змінна - це буквене позначення комірок пам'яті, в якій зберігається деяке значення певного типу
'''

#Написати програму яка отримує від користувача два числа
print('\nПрості математичні функції: ')
fst_num = int(input("ВВедіть перше число: ", ))
scd_num = int(input("ВВедіть друге число: ", ))
print("Множення: ", fst_num * scd_num,"\nДілення: ", int(fst_num / scd_num),"\nДодавання: ", fst_num + scd_num,"\nРізниця: ", fst_num - scd_num,"\nЗвести в ступінь: ", fst_num ** scd_num,"\nЦілочисельне ділення: ", fst_num // scd_num,"\nЗалишок від ділення: ", fst_num % scd_num)


#Ведіть ім'я, прізвище та вік користувача
print('\nДанні користувача: ')
print('\nName: ', input('Enter your name: ', ),'\tSurname: ', input('Enter your surname: ', ),'\tYou are: ', int(input('Enter your age: ', )),)


#Написати програму, яка отримує дві змінні типу int і міняє їх значення місцями.Зробіть це 3 різними способами
'''
a = 1
b = 2
c = b
b = a
a = c
print(a, b)

a = 1
b = 2
a = 2
b = 1
print(a, b)

a = 1
b = 2
a, b = b, a
print(a,b)
'''

#Написати програму, яка отримує дві змінні від користувача, виведіть в консоль максимальне значення
print('\nМаксимальне значення з двох змінних: ')
fst_var = int(input("Введіть першу змінну: "))
scd_var = int(input("Введіть другу змінну: "))
print("Максимальне значення: ",max(fst_var, scd_var))

#Написати програму яка приямає від користувача тризначне число та перевернути його
print('\nРеверс тризначного числа: ')
num_of_three = input("Введить тризначне число: ", )
if len(num_of_three) > 3 or len(num_of_three) < 3:
    print("Error! Only 3 characters allowed!") 
else:
    num_of_three = int(num_of_three[::-1])
    print("Reversed: ",num_of_three)





